/* 
  В предыдущей главе была упомянута функция Math.min,
  возвращающая самый маленький из аргументов. Теперь
  мы можем написать такую функцию сами. Напишите
  функцию min, принимающую два аргумента, и
  возвращающую минимальный из них.
*/

function getMin(arg_1, arg_2) {
  return (arg_1 < arg_2) ? arg_1 : arg_2;
}

/*
  Мы видели, что оператор % (остаток от деления) может
  использоваться для определения того, чётное ли число (
  % 2). А вот ещё один способ определения:
  Ноль чётный.
  Единица нечётная.
  У любого числа N чётность такая же, как у N - 2.
  Напишите рекурсивную функцию isEven согласно этим
  правилам. Она должна принимать число и возвращать
  булевское значение.

  Потестируйте её на 50 и 75. Попробуйте задать ей -1.
  Почему она ведёт себя таким образом? Можно ли её как-
  то исправить?
*/

// Мое решение
function isEven(n) {
  if ( n  === 0 ) {
    return true;
  } else if ( n < 0) {
    return false;
  } else {
    return isEven(n - 2)
  }
}

//Решение автора
function isEven(n) {
  if (n == 0)
    return true;
  else if (n == 1)
    return false;
  else if (n < 0)
    return isEven(-n);
  else
    return isEven(n - 2);
}

/*
  Считаем бобы
    Символ номер N строки можно получить, добавив к ней
  .charAt(N) ( "строчка".charAt(5) ) – схожим образом с
  получением длины строки при помощи .length.
  Возвращаемое значение будет строковым, состоящим из
  одного символа (к примеру, "к"). У первого символа строки
  позиция 0, что означает, что у последнего символа
  позиция будет string.length - 1. Другими словами, у строки
  из двух символов длина 2, а позиции её символов будут 0
  и 1.
  Напишите функцию countBs, которая принимает строку в
  качестве аргумента, и возвращает количество символов
  “B”, содержащихся в строке.

    Затем напишите функцию countChar, которая работает
  примерно как countBs, только принимает второй параметр
  — символ, который мы будем искать в строке (вместо
  того, чтобы просто считать количество символов “B”). Для
  этого переделайте функцию countBs.
*/

function countBs(str) {
  for (var i = 0, n = 0; i < str.length; i++) {
    if (str[i] == 'b' || str[i] == 'B') {
      n++;
    }
  }
  return n;
}

function countChar(str, char) {
  for (var i = 0, n = 0; i < str.length; i++) {
    if (str[i] == char) {
      n++;
    }
  }
  return n;
}

function countBs(str) {
  return countChar(str);
}


/*
  Треугольник в цикле
  Напишите цикл, который за 7 вызовов console.log
  выводит такой треугольник:
  #
  ##
  ###
  ####
  #####
  ######
  #######
*/


var a = '';
function makeTriangle(n) {
  if (n != 0) {
    console.log(a += '#' )
    return makeTriangle(n-1);
  } 
}